app/nvmf_iaa/fio_engine/results_lat/1k_latency.out
=== run_latency.sh ===
timestamp: 2026-04-07 22:46:09
rw: write
cq_size: 32
total_ios: 32
bs: 1k
size: 32768
fio: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio/fio
engine: /home/xuanboj2/spdk-iaa/app/nvmf_iaa/fio_engine/iaanic.so
poll_usleep: 0
job: (g=0): rw=write, bs=(R) 1024B-1024B, (W) 1024B-1024B, (T) 1024B-1024B, ioengine=snic_phase1, iodepth=1
fio-3.41-142-g698f
Starting 1 thread
EAL: '-c <coremask>' option is deprecated, and will be removed in a future release
EAL: 	Use '-l <corelist>' or '--lcores=<corelist>' option instead
[Init] Probing Target 192.168.200.20:4420...
[Init] Attaching to 192.168.200.20
[Init] Attached to NVMe Controller
[Init] Allocated IO QPair. Negotiated QID: 1
[RDMA] Resolving SNIC address 192.168.200.11:18515...
[RDMA] Resolving route...
[RDMA] Connecting to SNIC...
[RDMA] SNIC Connection established!
[Init] Registering Memory...
[Init] Cleaning IAA Completion Buffer
[Init] Mapping IAA Portal at /dev/iax/wq1.0...
[Init] Allocating COMP/DECOMP AECS buffers
[Init] COMP AECS loaded:   addr=0x77b1d4119240 size=1568
[Init] DECOMP AECS loaded: addr=0x77b1d4131a80 size=5376
[Init] Initing SETUP MSG...
[Init] All systems OK. Staging Buffer: 64 MB (Hugepages)
[Init] Sending SETUP Message to SNIC...
[SETUP] comp_aecs_addr=0x77b1d4119240 comp_aecs_size=1568
[SETUP] decomp_aecs_addr=0x77b1d4131a80 decomp_aecs_size=5376
[Init] SETUP Message Sent successfully.
sizeof(struct snic_setup_msg) = 80

job: (groupid=0, jobs=1): err= 0: pid=22574: Tue Apr  7 22:46:10 2026
  write: IOPS=16.0k, BW=15.6MiB/s (16.4MB/s)(32.0KiB/2msec)
    clat (nsec): min=34071, max=67717, avg=39777.78, stdev=5907.39
     lat (nsec): min=34128, max=68622, avg=39875.34, stdev=6037.92
    clat percentiles (nsec):
     |  1.00th=[34048],  5.00th=[34560], 10.00th=[36096], 20.00th=[37120],
     | 30.00th=[37632], 40.00th=[38144], 50.00th=[38144], 60.00th=[39168],
     | 70.00th=[39168], 80.00th=[40704], 90.00th=[43264], 95.00th=[49408],
     | 99.00th=[68096], 99.50th=[68096], 99.90th=[68096], 99.95th=[68096],
     | 99.99th=[68096]
  lat (usec)   : 50=96.88%, 100=3.12%
  cpu          : usr=100.00%, sys=0.00%, ctx=0, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0.00ns, window=0.00ns, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=15.6MiB/s (16.4MB/s), 15.6MiB/s-15.6MiB/s (16.4MB/s-16.4MB/s), io=32.0KiB (32.8kB), run=2-2msec